mysql/mysql-fifth-edition-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-25 三 16:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>mysql技术内幕（第五版）</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="phenix3443" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">mysql技术内幕（第五版）</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge9dda52">1. 第 1 章 MySql 入门</a></li>
<li><a href="#orgb935264">2. 第 2 章 使用 SQL 管理数据</a>
<ul>
<li><a href="#orgcecb94e">2.1. 2.1 服务器的 SQL 模式</a></li>
<li><a href="#org039e60e">2.2. 2.2 服务器的标识符语法和命名规则</a></li>
<li><a href="#org759db62">2.3. 2.3 SQL 语句的大小写规则</a></li>
<li><a href="#org8e33b0d">2.4. 2.4 字符集支持</a></li>
<li><a href="#org6d97c63">2.5. 2.5 数据库的选择、创建、删除和更改</a></li>
<li><a href="#org6be7a76">2.6. 2.6 表的创建、删除、索引和更改</a></li>
<li><a href="#orged65bcc">2.7. 2.7 获取数据库元数据</a></li>
<li><a href="#org8f57b62">2.8. 2.8 使用连接实现多表检索</a></li>
<li><a href="#org711cb56">2.9. 2.9 使用子查询实现多表检索</a></li>
<li><a href="#orgd5acedd">2.10. 2.10 使用 union 实现多表检索</a></li>
<li><a href="#org36bfe67">2.11. 2.11 多表删除和更新</a></li>
<li><a href="#orgacd333d">2.12. 2.12 事务处理</a></li>
<li><a href="#orga186603">2.13. 2.13 外键和引用完整性</a></li>
<li><a href="#orgf3d8642">2.14. 2.14 使用 FULLTEXT 索引</a></li>
</ul>
</li>
<li><a href="#orgf1c0338">3. 第 3 章 数据类型</a>
<ul>
<li><a href="#org153f11c">3.1. 3.1 数据值类别</a></li>
<li><a href="#org1c237a8">3.2. 3.2 MySql 数据类型</a></li>
<li><a href="#org637494a">3.3. 3.3 MySql 如何处理无效数据</a></li>
<li><a href="#org05646cd">3.4. 3.4 处理序列</a></li>
<li><a href="#org5e2a0b7">3.5. 3.5 表达式计算和类型转换</a></li>
<li><a href="#org74c86b3">3.6. 3.6 选择数据类型</a></li>
</ul>
</li>
<li><a href="#org5948f14">4. 第 4 章 视图和存储程序</a>
<ul>
<li><a href="#orge05c420">4.1. 4.1 使用视图</a></li>
<li><a href="#orge5014ca">4.2. 4.2 使用存储程序</a></li>
<li><a href="#org948d200">4.3. 4.3 视图和存储程序的安全性</a></li>
</ul>
</li>
<li><a href="#org4d90fa7">5. 第 5 章 查询优化</a>
<ul>
<li><a href="#org5d4d266">5.1. 5.1 使用索引</a></li>
<li><a href="#orga1123c6">5.2. 5.2 MySql 查询优化程序</a></li>
<li><a href="#org937aff0">5.3. 5.3 选择有利于高效查询的数据类型</a></li>
<li><a href="#org0fbec59">5.4. 5.4 选择有利于高效查询的表存储方式</a></li>
<li><a href="#org3182a11">5.5. 5.5 高效加载数据</a></li>
<li><a href="#orgad74345">5.6. 5.6 调度、锁定和并发</a></li>
</ul>
</li>
<li><a href="#org4fde196">6. 第 10 章 MySql 管理简介</a></li>
<li><a href="#org3b6f04c">7. 第 11 章 MySql 数据目录</a></li>
<li><a href="#org4c63dad">8. 第 12 章 MySql 基本管理</a></li>
<li><a href="#org85710ff">9. 第 13 章 安全性和访问控制</a></li>
<li><a href="#org3f7de63">10. 第 14 章 数据库维护、备份和复制</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge9dda52" class="outline-2">
<h2 id="orge9dda52"><span class="section-number-2">1</span> 第 1 章 MySql 入门</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-sh">mysql &lt; test.sql
</pre>
</div>

<ul class="org-ul">
<li>条件判断
<ul class="org-ul">
<li>IF</li>
</ul></li>

<li>字符串函数：
<ul class="org-ul">
<li>FORMAT</li>
<li>CONCAT</li>
<li>LIKE: '_' '%'</li>
<li>REGEXP</li>
</ul></li>
<li>数学函数：
<ul class="org-ul">
<li>SQRT</li>
</ul></li>
<li>时间函数：
<ul class="org-ul">
<li>STR_TO_DATE</li>
<li>YEAR</li>
<li>MONTH</li>
<li>DAYOFMONTH</li>
<li>CURDATE</li>
<li>TIMESTAMPDIFF</li>
<li>TO_DAYS</li>
<li>DATE_ADD</li>
<li>DATE_SUB</li>
</ul></li>
</ul>

<p>
自定义变量：
</p>
<ul class="org-ul">
<li>select @var:=field from table where cond;</li>
<li>set @var=val</li>
<li>select @var;</li>
</ul>

<p>
select count(*) from tb group by field WITH ROLLUP; 显示统计数据求和。类似 excel 列的汇总结果。
</p>
</div>
</div>

<div id="outline-container-orgb935264" class="outline-2">
<h2 id="orgb935264"><span class="section-number-2">2</span> 第 2 章 使用 SQL 管理数据</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgcecb94e" class="outline-3">
<h3 id="orgcecb94e"><span class="section-number-3">2.1</span> 2.1 服务器的 SQL 模式</h3>
</div>

<div id="outline-container-org039e60e" class="outline-3">
<h3 id="org039e60e"><span class="section-number-3">2.2</span> 2.2 服务器的标识符语法和命名规则</h3>
</div>

<div id="outline-container-org759db62" class="outline-3">
<h3 id="org759db62"><span class="section-number-3">2.3</span> 2.3 SQL 语句的大小写规则</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>sql 关键字和函数名不区分大小写。</li>
<li>数据库名、表名、视图名默认大小写取决于服务器主机上的操作系统在文件方面的规定。</li>
<li>存储过程和事件名字不区分大小写。触发器的名字区分大小写。</li>
<li>列名和索引名不区分大小写。</li>
</ul>
</div>
</div>

<div id="outline-container-org8e33b0d" class="outline-3">
<h3 id="org8e33b0d"><span class="section-number-3">2.4</span> 2.4 字符集支持</h3>
</div>

<div id="outline-container-org6d97c63" class="outline-3">
<h3 id="org6d97c63"><span class="section-number-3">2.5</span> 2.5 数据库的选择、创建、删除和更改</h3>
</div>

<div id="outline-container-org6be7a76" class="outline-3">
<h3 id="org6be7a76"><span class="section-number-3">2.6</span> 2.6 表的创建、删除、索引和更改</h3>
<div class="outline-text-3" id="text-2-6">
<p>
<code>.frm</code> 保存表的定义。除非进行配置（innodb_file_per_table），InnoDB 引擎会把标的数据和索引存储在它的系统空间里。
</p>

<p>
临时表在客户端回话结束后自动删除，并且每个客户端只能看到自己的临时表。
</p>

<p>
CREATE TABLE &#x2026; SELECT 不会复制所有的列属性，比如 AUTO_INCREMENT，索引定义。
</p>

<p>
<b>应该使用分区表还是手动分表？</b>
</p>

<p>
primary key 和 unique 索引的区别：
</p>
<ul class="org-ul">
<li>primary key 只能有一个。</li>
<li>primary key 中的列不能包含 null 值，unique 可以。</li>
</ul>
</div>
</div>

<div id="outline-container-orged65bcc" class="outline-3">
<h3 id="orged65bcc"><span class="section-number-3">2.7</span> 2.7 获取数据库元数据</h3>
<div class="outline-text-3" id="text-2-7">
<p>
show 语句查询多种类型的元数据。
</p>

<p>
INFORMATION_SCHEMA 数据库查询元数据。
</p>
</div>
</div>

<div id="outline-container-org8f57b62" class="outline-3">
<h3 id="org8f57b62"><span class="section-number-3">2.8</span> 2.8 使用连接实现多表检索</h3>
<div class="outline-text-3" id="text-2-8">
<p>
using 子句概念上类似于 on 子句，但要求被连接的列 必须同名。最佳实践：设计表的时候，相同含义的字段名称保持一致。
</p>

<p>
左连接结果集中，对于右表中没有匹配的行，都设置为 NULL。
</p>
</div>
</div>

<div id="outline-container-org711cb56" class="outline-3">
<h3 id="org711cb56"><span class="section-number-3">2.9</span> 2.9 使用子查询实现多表检索</h3>
<div class="outline-text-3" id="text-2-9">
<p>
子查询的结果有多种，测试方法也有多种：=, !=, in, not in, any, all, exists,not exists.
</p>

<p>
相当一部分子查询可以修改为连接，连接的效率有时候会比子查询更好些。
</p>
</div>
</div>

<div id="outline-container-orgd5acedd" class="outline-3">
<h3 id="orgd5acedd"><span class="section-number-3">2.10</span> 2.10 使用 union 实现多表检索</h3>
<div class="outline-text-3" id="text-2-10">
<p>
默认情况下，Union 会将结果集中的 重复行剔除。如果想保留重复的行，要使用 union all。
</p>
</div>
</div>

<div id="outline-container-org36bfe67" class="outline-3">
<h3 id="org36bfe67"><span class="section-number-3">2.11</span> 2.11 多表删除和更新</h3>
</div>

<div id="outline-container-orgacd333d" class="outline-3">
<h3 id="orgacd333d"><span class="section-number-3">2.12</span> 2.12 事务处理</h3>
<div class="outline-text-3" id="text-2-12">
<p>
事务隔离遇到的问题：
</p>
<ul class="org-ul">
<li>脏读：事务所做操作尚未提交，别的事务就能看到这些修改。（自己改动的记录被看到）</li>
<li>不可重复读：同一事务使用同一条 select 语句在每次读取时得到的结果不一样。（看到别人修改的记录）</li>
<li>幻读行：事务中看到以前没有过得行。（看到别人新增的记录）</li>
</ul>

<p>
InnoDB 提供四种事务隔离级别：
</p>
<ul class="org-ul">
<li>read uncommited。：脏读，不可重复度，幻读行</li>
<li>read commited。不可重复读，幻读行。</li>
<li>repeatable Read.(默认)</li>
<li>serializable.</li>
</ul>
</div>
</div>

<div id="outline-container-orga186603" class="outline-3">
<h3 id="orga186603"><span class="section-number-3">2.13</span> 2.13 外键和引用完整性</h3>
</div>

<div id="outline-container-orgf3d8642" class="outline-3">
<h3 id="orgf3d8642"><span class="section-number-3">2.14</span> 2.14 使用 FULLTEXT 索引</h3>
<div class="outline-text-3" id="text-2-14">
<p>
三种搜索类型：
</p>
<ul class="org-ul">
<li>自然语言搜索（默认）：字符串解析成单词</li>
<li>布尔模式搜索：包含修饰符，指定搜索要要求。</li>
<li>查询扩展搜索：二阶段搜索，扩展大搜索范围，查找自然搜索匹配不到的行。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf1c0338" class="outline-2">
<h2 id="orgf1c0338"><span class="section-number-2">3</span> 第 3 章 数据类型</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org153f11c" class="outline-3">
<h3 id="org153f11c"><span class="section-number-3">3.1</span> 3.1 数据值类别</h3>
<div class="outline-text-3" id="text-3-1">
<p>
字符集和排序规则：CHARSET() COLLATION() CONVERT()
</p>

<p>
字符串长度：CHAR_LENGTH LENGTH
</p>

<p>
时态：DATE_FORMAT() STR_TO_DATE()
</p>
</div>
</div>

<div id="outline-container-org1c237a8" class="outline-3">
<h3 id="org1c237a8"><span class="section-number-3">3.2</span> 3.2 MySql 数据类型</h3>
<div class="outline-text-3" id="text-3-2">
<p>
定义数据列的时候，遵循通用属性，特殊属性的顺序。
</p>

<p>
VARCHAR(M), M 最大为 65535 个字符，因为 MySql 中，行的最大长度是 65535.
</p>

<p>
LIKE 与 REGEXP 区别：
</p>
<ul class="org-ul">
<li>LIKE 模式只能用于匹配整个字符串。REGEXP 可以匹配 字符串的任何部分。</li>
<li>LIKE 运算符是多字节安全的。REGEXP 只能正确的处理单字节字符集。</li>
</ul>

<p>
BLOB 最大可以到 4GB，
</p>

<p>
AUTO_INCRMENT 应该具备 NOT NULL 属性约束，而且必需被索引。因为不可能为负数，所以最好加上 UNSIGNED，这样可以使范围扩大一倍。
</p>

<p>
ENUM 最多能够指定 65535 成员，存储空间由成员个数确定；
</p>

<p>
SET 最多 64 个成员，每个成员都是一个二进制位，成员的数值都是 2 的幂。二者插入合法值时都不区分大小写。
</p>

<p>
ENUM 和 SET 类型要比其他字符串类型有着更好的处理性能，因为它们可以用数字操作替换字符串操作进行处理。
</p>
</div>
</div>


<div id="outline-container-org637494a" class="outline-3">
<h3 id="org637494a"><span class="section-number-3">3.3</span> 3.3 MySql 如何处理无效数据</h3>
</div>

<div id="outline-container-org05646cd" class="outline-3">
<h3 id="org05646cd"><span class="section-number-3">3.4</span> 3.4 处理序列</h3>
<div class="outline-text-3" id="text-3-4">
<p>
LAST_INSERT_ID()只会依赖于服务器的当前会话连接所产生的 AUTO_INCREMENT 值。
</p>

<p>
多行 INSERT 语句，LAST_INSERT_ID()只会返回第一个。
</p>
</div>
</div>

<div id="outline-container-org5e2a0b7" class="outline-3">
<h3 id="org5e2a0b7"><span class="section-number-3">3.5</span> 3.5 表达式计算和类型转换</h3>
</div>

<div id="outline-container-org74c86b3" class="outline-3">
<h3 id="org74c86b3"><span class="section-number-3">3.6</span> 3.6 选择数据类型</h3>
</div>
</div>

<div id="outline-container-org5948f14" class="outline-2">
<h2 id="org5948f14"><span class="section-number-2">4</span> 第 4 章 视图和存储程序</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge05c420" class="outline-3">
<h3 id="orge05c420"><span class="section-number-3">4.1</span> 4.1 使用视图</h3>
</div>
<div id="outline-container-orge5014ca" class="outline-3">
<h3 id="orge5014ca"><span class="section-number-3">4.2</span> 4.2 使用存储程序</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>存储函数</li>
<li>存储过程</li>
<li>触发器</li>
<li>事件</li>
</ul>
</div>
</div>
<div id="outline-container-org948d200" class="outline-3">
<h3 id="org948d200"><span class="section-number-3">4.3</span> 4.3 视图和存储程序的安全性</h3>
</div>
</div>
<div id="outline-container-org4d90fa7" class="outline-2">
<h2 id="org4d90fa7"><span class="section-number-2">5</span> 第 5 章 查询优化</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org5d4d266" class="outline-3">
<h3 id="org5d4d266"><span class="section-number-3">5.1</span> 5.1 使用索引</h3>
<div class="outline-text-3" id="text-5-1">
<p>
默认情况下，InnoDB 引擎只使用一个表空间，在这个表空间内部，管理所有 InnoDB 表的数据存储和索引存储。
</p>

<p>
可以配置 InnoDB，让它创建的每个表都有自己的表空间，但是即便如此，给定表的数据和索引也同样保存在同一个表空间中。
</p>

<p>
MySql 使用索引的方式有以下集几种：
</p>
<ul class="org-ul">
<li>WHERE 语句。</li>
<li>MIN(),MAX()</li>
<li>ORDER BY 和 GROUP BY 子句</li>
<li>直接读取索引查询所要求的所有信息。</li>
</ul>

<p>
索引代价:
</p>
<ul class="org-ul">
<li>增加了磁盘空间。</li>
<li>降低了索引列插入、删除和更新值的速度。</li>
</ul>

<p>
如何确定索引列：
</p>
<ul class="org-ul">
<li>为用于搜索、排序或者分组的列创建索引，而用于输出的列则不用创建索引。</li>
<li>认真考虑数据列计数。列基数高（重复值少）索引使用的效果越好。</li>
<li><p>
索引短小值
</p>
<ul class="org-ul">
<li>短小值让比较操作更加方便，从而加快索引查找速度。</li>
<li>短小值让索引更加短小，键缓存里的索引块可以容纳更多的值，这样内存可以容纳更多的索引快，减少 io 磁盘请求。</li>
</ul>

<p>
InnoDB 使用的是聚簇索引，聚簇索引会把数据行和主键存储在一起（即聚集在一起）。其他的索引都是二级索引，它们把主键值和二级索引值存储在一起。
</p></li>
<li>索引字符串值使用前缀索引。</li>
<li>利用最左前缀。</li>
<li>不要建立过多的索引。</li>
<li>让参与比较的索引类型保持匹配。
<ul class="org-ul">
<li>散列索引。适用于完成 <code>=</code> 或 <code>&lt;&gt;</code> 精确匹配的操作。</li>
<li>B 树索引。适用于范围比较 <code>&lt; &gt; between</code> 等。</li>
</ul></li>
<li>利用慢查询日志找到性能低劣的查询。</li>
</ul>
</div>
</div>

<div id="outline-container-orga1123c6" class="outline-3">
<h3 id="orga1123c6"><span class="section-number-3">5.2</span> 5.2 MySql 查询优化程序</h3>
<div class="outline-text-3" id="text-5-2">
<p>
如何优化查询：
</p>
<ul class="org-ul">
<li>分析表：ANALYSE TABLE</li>
<li>使用 EXPLAIN 验证优化程序的操作。</li>
<li>在必要时给予优化程序提示或改写它。 <code>FORCE INDEX/USE INDEX/IGNORE INDEX/STRAIGHT_JOIN</code></li>
<li>比较拥有相同数据类型的列。</li>
<li>让索引列在比较表达式中单独出现。</li>
<li>不要在 LIKE 模式的开始位置使用通配符。</li>
<li>利用优化程序的长处。</li>
<li>测试查询的各种替代形式，并多次运行它们。</li>
<li>避免过多是使用自动类型转换。</li>
</ul>

<p>
如何使用 EXPLAIN 查看语句执行流程。
</p>
</div>
</div>

<div id="outline-container-org937aff0" class="outline-3">
<h3 id="org937aff0"><span class="section-number-3">5.3</span> 5.3 选择有利于高效查询的数据类型</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>多用数字运算，少用字符串运算。</li>
<li>选择够用的小类型。</li>
<li>把数据列定义为 NOT NULL，因为查询期间，不再需要检查该列是否为 NULL</li>
<li>整理碎片。方法：先 mysqldump 转存，然后重建。</li>
<li>把数据压缩到 BLOB 或 TEXT 列</li>
<li>使用合成索引。</li>
<li>避免检索很大的 BLOB 或 TEXT。</li>
<li>把 BLOB 或 TEXT 列剥离出来形成单独的表。</li>
</ul>
</div>
</div>

<div id="outline-container-org0fbec59" class="outline-3">
<h3 id="org0fbec59"><span class="section-number-3">5.4</span> 5.4 选择有利于高效查询的表存储方式</h3>
<div class="outline-text-3" id="text-5-4">
<p>
InnoDB 不会区别对待固定长度和可变长度列（所有行都使用一个指向列值的头指针），所以使用 char 列在本质上不会比 varchar 列更简单。二者主要的性能因素在于行占用的存储量。
</p>
</div>
</div>

<div id="outline-container-org3182a11" class="outline-3">
<h3 id="org3182a11"><span class="section-number-3">5.5</span> 5.5 高效加载数据</h3>
<div class="outline-text-3" id="text-5-5">
<p>
LOAD DATA 的效率要比 INSERT 高。
</p>

<p>
LOAD DATA 在不带 LOCAL 的情况下效率会更高。
</p>

<p>
如果必须使用 INSERT，优先使用单条语句插入多个行的形式。
</p>
</div>
</div>

<div id="outline-container-orgad74345" class="outline-3">
<h3 id="orgad74345"><span class="section-number-3">5.6</span> 5.6 调度、锁定和并发</h3>
</div>
</div>

<div id="outline-container-org4fde196" class="outline-2">
<h2 id="org4fde196"><span class="section-number-2">6</span> 第 10 章 MySql 管理简介</h2>
</div>

<div id="outline-container-org3b6f04c" class="outline-2">
<h2 id="org3b6f04c"><span class="section-number-2">7</span> 第 11 章 MySql 数据目录</h2>
</div>

<div id="outline-container-org4c63dad" class="outline-2">
<h2 id="org4c63dad"><span class="section-number-2">8</span> 第 12 章 MySql 基本管理</h2>
</div>

<div id="outline-container-org85710ff" class="outline-2">
<h2 id="org85710ff"><span class="section-number-2">9</span> 第 13 章 安全性和访问控制</h2>
</div>

<div id="outline-container-org3f7de63" class="outline-2">
<h2 id="org3f7de63"><span class="section-number-2">10</span> 第 14 章 数据库维护、备份和复制</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: phenix3443</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-25 三 16:18</p>
<p class="validation"></p>
</div>
</body>
</html>
